src/test/resources/WAY4/getLoanContractOverdueListToWAY4.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:asi="http://siebel.com/asi/">
<soapenv:Header/>
<soapenv:Body>
<asi:GetLoanByContractFS_Input>
    <asi:Headerinfo RqUID="B719B223F2CA4bd6BCCEE314F7ACA081" RqType="GetLoanByContractFS_Input" RqTm="07/23/2021
    17:32:59" SystemFrom="SBL_CL" SystemTo="WAY" ContextUserlnfo="5574058" ContextId="1-F826W-204" IPAddress="10.64.50.172"
    Sessionid=""/>
    <asi:GetLoanByContractFS>
        <asi:RequestDatel>?</asi:RequestDatel>
        <asi:ListOfFINCORPAccount>
        //or more repetitions:
        <asi:FINCORPAccount>
        <asi:BranchCode>00000</asi:BranchCode>
        <asi:CreditID>625/0000-0246284</asi:CreditID>
        //Optional:
        <asi:CreditType>?</asi:CreditType>
        //Optional:
        <asi:CardNumber>4272300036678941</asi:CardNumber>
        </asi:FINCORPAccount>
        </asi:ListOfFINCORPAccount>
        </asi:GetLoanByContractFS>
        </asi:GetLoanByContractFS_Input>
        </soapenv:Body>
        </soapenv:Envelope>


<soapenv:Envelope
xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
xmlns:tem="http://tempuri.org/">
<soapenv:Header/>
<soapenv:Body>
    <tem:pay>
        <tem:merchantId>7507231</tem:merchantId>
        <tem:branch>Licensed Branch Name</tem:branch>
        <tem:alias>Service alias Name</tem:alias>
        <tem:paymentId>merchants payment idetificator</tem:paymentId>
        <tem:data>
            <tem:param>
                <tem:key>account</tem:key>
                <tem:value>account cridentials</tem:value>
            </tem:param>
        </tem:data>
        <tem:hash>?</tem:hash>
    </tem:pay>
</soapenv:Body>
</soapenv:Envelope>